{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v1.7.0", "userDefinedMetadata": {"signature": {"inputs": {"f0_hz:0": {"name": "f0_hz:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "loudness_db:0": {"name": "loudness_db:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "80000"}]}}}}}, "modelTopology": {"node": [{"name": "f0_hz", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "loudness_db", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72", "op": "NoOp", "input": ["^f0_hz", "^loudness_db"]}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/random_uniform/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/random_uniform/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/random_uniform/min", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/zeros/packed", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/zeros/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/packed", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/zeros_1/packed", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/zeros_1/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/zeros_like", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/concat_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/ones_like/Shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/ones_like/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/concat_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/add_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1250"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/GatherV2/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/concat_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft/Pad/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/BroadcastTo", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1250"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul_8/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add_3/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/Log_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add_4/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like_2/shape_as_tensor", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like_2/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/irfft/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/fftshift_1/floordiv", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/fftshift_1/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft_1/Pad/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft_1/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/irfft_1/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_10/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_10/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_10/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/GreaterEqual_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like_1/shape_as_tensor", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like_1/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/Log", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/GreaterEqual/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like/shape_as_tensor", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul_1/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_140", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_136", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_132", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_128", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_124", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_120", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_116", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_112", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_108", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_104", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_100", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_96", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_92", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_88", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_84", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_80", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/resize/size", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_3/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_3/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_3_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/LessEqual/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/SelectV2/t", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_2_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_75", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "2"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_76", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_77", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_78", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize/moments/mean/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize/moments/variance/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize/Reshape_1/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_79", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_2/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_2/Conv2D/SpaceToBatchND/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_81", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_2/Conv2D/BatchToSpaceND/block_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_2/Conv2D/BatchToSpaceND/crops", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_82", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_1/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_1/moments/mean/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_1/moments/variance/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_1/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_1/Reshape_1/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_83", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_3/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_3/Conv2D/SpaceToBatchND/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_85", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_3/Conv2D/BatchToSpaceND/block_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_3/Conv2D/BatchToSpaceND/crops", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_86", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_2/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_2/moments/mean/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_2/moments/variance/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_2/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/normalize_2/Reshape_1/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_87", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/dilated_conv_decoder/dilated_conv_stack/dilated_conv/conv2d_4/Conv2D/SpaceToBatchND/block_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": 